
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       3 |          3 |           3 |
## Affected resources by action

|  Action  | Resources                                                        |
|:--------:|:-----------------------------------------------------------------|
|    🟡     | `module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin` |
|    🟡     | `module.jumphost.aws_lambda_function.update_dns`                 |
|    🟡     | `module.jumphost.module.jumphost_profile.aws_iam_policy.profile` |
|    🟡     | `module.jumphost.null_resource.install_python_dependencies:`     |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/69c428a5-9f04-4ff2-81c1-e8936d8a2352/terraform-bin plan -no-color --out=tf.plan
module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=9014709996754264021]
module.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=38bfe158-2399-a643-d7af-bc78e5c1d82b]
module.release_infrahouse_com.random_password.passphrase: Refreshing state... [id=none]
module.release_infrahouse_com.aws_acm_certificate.release_infrahouse: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/5157697d-b178-489d-ab93-70790bc3988f]
module.jumphost.data.aws_iam_policy_document.assume_role: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...
data.aws_ami.ubuntu_22: Reading...
module.release_infrahouse_com.aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-43APam]
module.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...
aws_key_pair.aleks: Refreshing state... [id=aleks]
module.jumphost.data.aws_ami.ubuntu_22: Reading...
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...
module.jumphost.data.aws_region.current: Reading...
data.aws_iam_policy.administrator-access: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]
data.aws_availability_zones.uw1: Reading...
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]
module.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.jumphost.data.aws_caller_identity.current: Reading...
module.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]
module.release_infrahouse_com.aws_s3_bucket.infrahouse-release: Refreshing state... [id=infrahouse-release]
module.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]
module.release_infrahouse_com.aws_cloudfront_cache_policy.default: Refreshing state... [id=ee31f6ed-c503-4082-a9d9-8517c9e4c872]
module.release_infrahouse_com.aws_s3_bucket.infrahouse-release-logs: Refreshing state... [id=infrahouse-release-logs]
module.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]
data.aws_availability_zones.uw1: Read complete after 1s [id=us-west-1]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...
data.aws_ami.ubuntu_22: Read complete after 1s [id=ami-05070c70d4ecc9f79]
module.release_infrahouse_com.aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-eTyKvi]
module.jumphost.data.aws_ami.ubuntu_22: Read complete after 1s [id=ami-05070c70d4ecc9f79]
module.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.jumphost.data.template_cloudinit_config.jumphost: Reading...
module.jumphost.data.template_cloudinit_config.jumphost: Read complete after 0s [id=521655773]
module.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]
module.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]
module.release_infrahouse_com.aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-eTyKvi|152EE331-A31D-43AB-AEDF-4C4D64D24C42]
module.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]
module.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]
module.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]
module.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]
module.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]
module.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]
module.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]
module.release_infrahouse_com.aws_route53_record.cert_validation["release.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__555256a386fd4aec9aaee8afdfe585a2.release.infrahouse.com._CNAME]
module.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]
module.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]
module.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]
module.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]
module.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]
module.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]
module.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]
module.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]
module.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]
module.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]
module.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]
module.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]
module.release_infrahouse_com.aws_acm_certificate_validation.release_infrahouse: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]
module.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]
module.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=38bfe158-2399-a643-d7af-bc78e5c1d82b.zip]
module.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]
module.release_infrahouse_com.aws_s3_bucket_ownership_controls.infrahouse-release-logs: Refreshing state... [id=infrahouse-release-logs]
module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]
module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]
module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]
module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]
module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]
module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]
module.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]
module.release_infrahouse_com.aws_s3_bucket_ownership_controls.infrahouse-release: Refreshing state... [id=infrahouse-release]
module.release_infrahouse_com.aws_s3_object.deb-gpg-key-infrahouse: Refreshing state... [id=DEB-GPG-KEY-infrahouse]
module.release_infrahouse_com.data.aws_iam_policy_document.public-access: Reading...
module.release_infrahouse_com.data.aws_iam_policy_document.public-access: Read complete after 0s [id=1594328150]
module.release_infrahouse_com.aws_s3_bucket_website_configuration.infrahouse-release: Refreshing state... [id=infrahouse-release]
module.release_infrahouse_com.aws_s3_object.index-html: Refreshing state... [id=index.html]
module.release_infrahouse_com.aws_s3_object.distributions: Refreshing state... [id=conf/distributions]
module.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]
data.aws_iam_policy_document.package-publisher: Reading...
module.release_infrahouse_com.aws_s3_bucket_public_access_block.infrahouse-release: Refreshing state... [id=infrahouse-release]
data.aws_iam_policy_document.package-publisher: Read complete after 0s [id=2170178410]
module.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]
module.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]
module.release_infrahouse_com.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-release]
aws_iam_policy.package-publisher: Refreshing state... [id=arn:aws:iam::493370826424:policy/package-publisher]
module.release_infrahouse_com.aws_s3_bucket_acl.infrahouse-release-logs: Refreshing state... [id=infrahouse-release-logs,private]
module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"]: Refreshing state... [id=jumphost20230710043044761000000002-20230721211001755300000001]
module.release_infrahouse_com.aws_s3_bucket_acl.infrahouse-release: Refreshing state... [id=infrahouse-release,public-read]
module.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]
module.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]
module.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...
module.release_infrahouse_com.aws_cloudfront_distribution.infrahouse-release: Refreshing state... [id=E2VVF6YTGSGRZ0]
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=3568021408]
module.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]
module.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]
module.release_infrahouse_com.aws_route53_record.release_infrahouse: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release.infrahouse.com_A]
module.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]
module.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]
module.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]
module.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...
module.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]
module.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]
module.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin will be updated in-place
  ~ resource "aws_iam_role" "admin" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action    = "sts:AssumeRoleWithWebIdentity"
                        Condition = {
                            StringEquals = {
                                "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                            StringLike   = {
                                "token.actions.githubusercontent.com:sub" = "repo:infrahouse/aws-control-493370826424:*"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            Federated = "arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com"
                        }
                        Sid       = "010"
                    },
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::493370826424:role/jumphost20230710043044761000000002"
                        }
                      - Sid       = "Statement1"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "ih-tf-aws-control-493370826424-admin"
        name                  = "ih-tf-aws-control-493370826424-admin"
        tags                  = {}
        # (10 unchanged attributes hidden)
    }

  # module.jumphost.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "modules/jumphost/update_dns"
      + type                = "zip"
    }

  # module.jumphost.aws_lambda_function.update_dns will be updated in-place
  ~ resource "aws_lambda_function" "update_dns" {
        id                             = "update_dns"
      ~ last_modified                  = "2023-07-16T15:03:25.000+0000" -> (known after apply)
      ~ s3_key                         = "38bfe158-2399-a643-d7af-bc78e5c1d82b.zip" -> (known after apply)
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.jumphost.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f27b24e4e38ea0a45a89a23fff8eeda5-3" -> (known after apply)
      ~ id                     = "38bfe158-2399-a643-d7af-bc78e5c1d82b.zip" -> (known after apply)
      ~ key                    = "38bfe158-2399-a643-d7af-bc78e5c1d82b.zip" # forces replacement -> (known after apply) # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "modules/jumphost/38bfe158-2399-a643-d7af-bc78e5c1d82b.zip" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.jumphost.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "9014709996754264021" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "main_version"         = "f00d03959844f917cec07fd990a227b0" -> "ff492ff0bab9c80216ea41aa46bf1fd2"
            # (1 unchanged element hidden)
        }
    }

  # module.jumphost.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "38bfe158-2399-a643-d7af-bc78e5c1d82b" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "f00d03959844f917cec07fd990a227b0" -> "ff492ff0bab9c80216ea41aa46bf1fd2"
            # (1 unchanged element hidden)
        }
      ~ result  = "38bfe158-2399-a643-d7af-bc78e5c1d82b" -> (known after apply)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id          = "arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001"
        name        = "jumphost20230710043044760400000001"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "sts:AssumeRole",
                          - "ec2:Describe*",
                        ] -> "ec2:Describe*"
                      ~ Sid      = "VisualEditor0" -> ""
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=9014709996754264021]%0Amodule.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=38bfe158-2399-a643-d7af-bc78e5c1d82b]%0Amodule.release_infrahouse_com.random_password.passphrase: Refreshing state... [id=none]%0Amodule.release_infrahouse_com.aws_acm_certificate.release_infrahouse: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/5157697d-b178-489d-ab93-70790bc3988f]%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.release_infrahouse_com.aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-43APam]%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Amodule.jumphost.data.aws_ami.ubuntu_22: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.jumphost.data.aws_region.current: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Amodule.release_infrahouse_com.aws_s3_bucket.infrahouse-release: Refreshing state... [id=infrahouse-release]%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.release_infrahouse_com.aws_cloudfront_cache_policy.default: Refreshing state... [id=ee31f6ed-c503-4082-a9d9-8517c9e4c872]%0Amodule.release_infrahouse_com.aws_s3_bucket.infrahouse-release-logs: Refreshing state... [id=infrahouse-release-logs]%0Amodule.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Adata.aws_availability_zones.uw1: Read complete after 1s [id=us-west-1]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...%0Adata.aws_ami.ubuntu_22: Read complete after 1s [id=ami-05070c70d4ecc9f79]%0Amodule.release_infrahouse_com.aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-eTyKvi]%0Amodule.jumphost.data.aws_ami.ubuntu_22: Read complete after 1s [id=ami-05070c70d4ecc9f79]%0Amodule.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]%0Amodule.jumphost.data.template_cloudinit_config.jumphost: Reading...%0Amodule.jumphost.data.template_cloudinit_config.jumphost: Read complete after 0s [id=521655773]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]%0Amodule.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]%0Amodule.release_infrahouse_com.aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-eTyKvi|152EE331-A31D-43AB-AEDF-4C4D64D24C42]%0Amodule.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]%0Amodule.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.release_infrahouse_com.aws_route53_record.cert_validation["release.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__555256a386fd4aec9aaee8afdfe585a2.release.infrahouse.com._CNAME]%0Amodule.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Amodule.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]%0Amodule.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Amodule.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]%0Amodule.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]%0Amodule.release_infrahouse_com.aws_acm_certificate_validation.release_infrahouse: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]%0Amodule.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=38bfe158-2399-a643-d7af-bc78e5c1d82b.zip]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Amodule.release_infrahouse_com.aws_s3_bucket_ownership_controls.infrahouse-release-logs: Refreshing state... [id=infrahouse-release-logs]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Amodule.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]%0Amodule.release_infrahouse_com.aws_s3_bucket_ownership_controls.infrahouse-release: Refreshing state... [id=infrahouse-release]%0Amodule.release_infrahouse_com.aws_s3_object.deb-gpg-key-infrahouse: Refreshing state... [id=DEB-GPG-KEY-infrahouse]%0Amodule.release_infrahouse_com.data.aws_iam_policy_document.public-access: Reading...%0Amodule.release_infrahouse_com.data.aws_iam_policy_document.public-access: Read complete after 0s [id=1594328150]%0Amodule.release_infrahouse_com.aws_s3_bucket_website_configuration.infrahouse-release: Refreshing state... [id=infrahouse-release]%0Amodule.release_infrahouse_com.aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com.aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]%0Adata.aws_iam_policy_document.package-publisher: Reading...%0Amodule.release_infrahouse_com.aws_s3_bucket_public_access_block.infrahouse-release: Refreshing state... [id=infrahouse-release]%0Adata.aws_iam_policy_document.package-publisher: Read complete after 0s [id=2170178410]%0Amodule.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.release_infrahouse_com.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-release]%0Aaws_iam_policy.package-publisher: Refreshing state... [id=arn:aws:iam::493370826424:policy/package-publisher]%0Amodule.release_infrahouse_com.aws_s3_bucket_acl.infrahouse-release-logs: Refreshing state... [id=infrahouse-release-logs,private]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"]: Refreshing state... [id=jumphost20230710043044761000000002-20230721211001755300000001]%0Amodule.release_infrahouse_com.aws_s3_bucket_acl.infrahouse-release: Refreshing state... [id=infrahouse-release,public-read]%0Amodule.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...%0Amodule.release_infrahouse_com.aws_cloudfront_distribution.infrahouse-release: Refreshing state... [id=E2VVF6YTGSGRZ0]%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=3568021408]%0Amodule.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]%0Amodule.release_infrahouse_com.aws_route53_record.release_infrahouse: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release.infrahouse.com_A]%0Amodule.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]%0Amodule.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]%0Amodule.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]%0Amodule.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin will be updated in-place%0A  ~ resource "aws_iam_role" "admin" {%0A      ~ assume_role_policy    = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                    # (1 unchanged element hidden)%0A                    {%0A                        Action    = "sts:AssumeRoleWithWebIdentity"%0A                        Condition = {%0A                            StringEquals = {%0A                                "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                            StringLike   = {%0A                                "token.actions.githubusercontent.com:sub" = "repo:infrahouse/aws-control-493370826424:*"%0A                            }%0A                        }%0A                        Effect    = "Allow"%0A                        Principal = {%0A                            Federated = "arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                        Sid       = "010"%0A                    },%0A                  - {%0A                      - Action    = "sts:AssumeRole"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "arn:aws:iam::493370826424:role/jumphost20230710043044761000000002"%0A                        }%0A                      - Sid       = "Statement1"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A        id                    = "ih-tf-aws-control-493370826424-admin"%0A        name                  = "ih-tf-aws-control-493370826424-admin"%0A        tags                  = {}%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # module.jumphost.data.archive_file.lambda will be read during apply%0A  # (config refers to values not yet known)%0A <= data "archive_file" "lambda" {%0A      + excludes            = [%0A          + "__pycache__",%0A        ]%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = (known after apply)%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_dir          = "modules/jumphost/update_dns"%0A      + type                = "zip"%0A    }%0A%0A  # module.jumphost.aws_lambda_function.update_dns will be updated in-place%0A  ~ resource "aws_lambda_function" "update_dns" {%0A        id                             = "update_dns"%0A      ~ last_modified                  = "2023-07-16T15:03:25.000+0000" -> (known after apply)%0A      ~ s3_key                         = "38bfe158-2399-a643-d7af-bc78e5c1d82b.zip" -> (known after apply)%0A        tags                           = {}%0A        # (21 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.jumphost.aws_s3_object.lambda_package must be replaced%0A-/+ resource "aws_s3_object" "lambda_package" {%0A      ~ bucket_key_enabled     = false -> (known after apply)%0A      ~ content_type           = "binary/octet-stream" -> (known after apply)%0A      ~ etag                   = "f27b24e4e38ea0a45a89a23fff8eeda5-3" -> (known after apply)%0A      ~ id                     = "38bfe158-2399-a643-d7af-bc78e5c1d82b.zip" -> (known after apply)%0A      ~ key                    = "38bfe158-2399-a643-d7af-bc78e5c1d82b.zip" # forces replacement -> (known after apply) # forces replacement%0A      + kms_key_id             = (known after apply)%0A      - metadata               = {} -> null%0A      ~ server_side_encryption = "AES256" -> (known after apply)%0A      ~ source                 = "modules/jumphost/38bfe158-2399-a643-d7af-bc78e5c1d82b.zip" -> (known after apply)%0A      ~ storage_class          = "STANDARD" -> (known after apply)%0A      - tags                   = {} -> null%0A      + version_id             = (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.jumphost.null_resource.install_python_dependencies must be replaced%0A-/+ resource "null_resource" "install_python_dependencies" {%0A      ~ id       = "9014709996754264021" -> (known after apply)%0A      ~ triggers = { # forces replacement%0A          ~ "main_version"         = "f00d03959844f917cec07fd990a227b0" -> "ff492ff0bab9c80216ea41aa46bf1fd2"%0A            # (1 unchanged element hidden)%0A        }%0A    }%0A%0A  # module.jumphost.random_uuid.lamda_src_hash must be replaced%0A-/+ resource "random_uuid" "lamda_src_hash" {%0A      ~ id      = "38bfe158-2399-a643-d7af-bc78e5c1d82b" -> (known after apply)%0A      ~ keepers = { # forces replacement%0A          ~ "main.py"          = "f00d03959844f917cec07fd990a227b0" -> "ff492ff0bab9c80216ea41aa46bf1fd2"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ result  = "38bfe158-2399-a643-d7af-bc78e5c1d82b" -> (known after apply)%0A    }%0A%0A  # module.jumphost.module.jumphost_profile.aws_iam_policy.profile will be updated in-place%0A  ~ resource "aws_iam_policy" "profile" {%0A        id          = "arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001"%0A        name        = "jumphost20230710043044760400000001"%0A      ~ policy      = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Action   = [%0A                          - "sts:AssumeRole",%0A                          - "ec2:Describe*",%0A                        ] -> "ec2:Describe*"%0A                      ~ Sid      = "VisualEditor0" -> ""%0A                        # (2 unchanged attributes hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A        tags        = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0APlan: 3 to add, 3 to change, 3 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC82OWM0MjhhNS05ZjA0LTRmZjItODFjMS1lODkzNmQ4YTIzNTIvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5tb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTkwMTQ3MDk5OTY3NTQyNjQwMjFdXG5tb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTM4YmZlMTU4LTIzOTktYTY0My1kN2FmLWJjNzhlNWMxZDgyYl1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLnJhbmRvbV9wYXNzd29yZC5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ub25lXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX2FjbV9jZXJ0aWZpY2F0ZS5yZWxlYXNlX2luZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLWVhc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvNTE1NzY5N2QtYjE3OC00ODlkLWFiOTMtNzA3OTBiYzM5ODhmXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi5cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQua2V5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLWtleS00M0FQYW1dXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWVfcm9sZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzY5MzQ0NTA5N11cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5hd3Nfa2V5X3BhaXIuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODk0MDY4ODI2XVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTIyNjUxOTJdXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MDM4NDkzMzFdXG5tb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi5cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGMudnBjOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3NfczNfYnVja2V0LmluZnJhaG91c2UtcmVsZWFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3NfY2xvdWRmcm9udF9jYWNoZV9wb2xpY3kuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWUzMWY2ZWQtYzUwMy00MDgyLWE5ZDktODUxN2M5ZTRjODcyXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3MzX2J1Y2tldC5pbmZyYWhvdXNlLXJlbGVhc2UtbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWxvZ3NdXG5tb2R1bGUuanVtcGhvc3QuYXdzX3MzX2J1Y2tldC5sYW1iZGFfdG1wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD11cy13ZXN0LTFdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLlxuZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YW1pLTA1MDcwYzcwZDRlY2M5Zjc5XVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLXBhc3NwaHJhc2UtZVR5S3ZpXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFtaS0wNTA3MGM3MGQ0ZWNjOWY3OV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGUuaWFtX2Zvcl9sYW1iZGE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhXVxubW9kdWxlLmp1bXBob3N0LmRhdGEudGVtcGxhdGVfY2xvdWRpbml0X2NvbmZpZy5qdW1waG9zdDogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEudGVtcGxhdGVfY2xvdWRpbml0X2NvbmZpZy5qdW1waG9zdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NTIxNjU1NzczXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2p1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjA0MDAwMDAwMDFdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWVUeUt2aXwxNTJFRTMzMS1BMzFELTQzQUItQUVERi00QzRENjREMjRDNDJdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9pbnN0YW5jZV9wcm9maWxlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0XVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQuc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fU1BGXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fVFhUXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC5teDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX01YXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfZGtpbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2dvb2dsZS5fZG9tYWlua2V5LmluZnJhaG91c2UuY29tX1RYVF1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvc2VydmljZS1yb2xlL0FXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMTYwMzUyNDZiNDkxMDJiNV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMmI0MmU3MGQ1MmE1ZGI3Zl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjEwMDAwMDAwMDItMjAyMzA3MTAwNDMwNDU3ODExMDAwMDAwMDNdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTAxNzU0MzQ4NzgwMDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wicmVsZWFzZS5pbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX181NTUyNTZhMzg2ZmQ0YWVjOWFhZWU4YWZkZmU1ODVhMi5yZWxlYXNlLmluZnJhaG91c2UuY29tLl9DTkFNRV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfbGF1bmNoX3RlbXBsYXRlLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wMWE4ZWY5NjgyMmI0YjAwYl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzODI5MzcxNjldXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA0YTE2ZTc0ZDViMTJhMzM4XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDE3OGUxNzE4ZGViYTUxY2VdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19pbnRlcm5ldF9nYXRld2F5LmlnOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pZ3ctMDc5MDkwZTA5ZWQ1ZGI1ODJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19kZWZhdWx0X3NlY3VyaXR5X2dyb3VwLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA4Yjk2MGI4NWY1OTk2MTAwXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBkNzMzODNhZmViNmFkMTQyXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTA4M2U5NjlkYzM3NzlhZjI2XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBjZmZmYWNhMzI1ZDkzODI3XVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlbGVhc2VfaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MDAwMS0wMS0wMSAwMDowMDowMCArMDAwMCBVVENdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODEwODAyODk0OTRdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMjEwODAyODk0OTRdXG5tb2R1bGUuanVtcGhvc3QuYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtanVtcGhvc3QtbGFtYmRhLTIwMjMwNzEzMjMzNDU5Njc1ODAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0LmF3c19zM19vYmplY3QubGFtYmRhX3BhY2thZ2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTM4YmZlMTU4LTIzOTktYTY0My1kN2FmLWJjNzhlNWMxZDgyYi56aXBdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuZGVmYXVsdF9tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZDczMzgzYWZlYjZhZDE0MjEwODAyODk0OTRdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5pbmZyYWhvdXNlLXJlbGVhc2UtbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWxvZ3NdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wZTc5NWJkYWVlNjI3YWE2Y11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA4YTQxMDE2MGUyZGNjNTkyXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMDhiMWNkMDZiMDQzMDk5ZWNdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wYmYyNzhiNmEzOTRhZWQ0NF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA5OWI5NThhZjE5NDg1ZjJiXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMDhmYjliNTI2ODMyNzc5NDddXG5tb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLmluZnJhaG91c2UtcmVsZWFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3MzX29iamVjdC5kZWItZ3BnLWtleS1pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ERUItR1BHLUtFWS1pbmZyYWhvdXNlXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzOiBSZWFkaW5nLi4uXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1OTQzMjgxNTBdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3NfczNfYnVja2V0X3dlYnNpdGVfY29uZmlndXJhdGlvbi5pbmZyYWhvdXNlLXJlbGVhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19vYmplY3QuaW5kZXgtaHRtbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5kZXguaHRtbF1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19vYmplY3QuZGlzdHJpYnV0aW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29uZi9kaXN0cmlidXRpb25zXVxubW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXBkYXRlX2Ruc11cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGFja2FnZS1wdWJsaXNoZXI6IFJlYWRpbmcuLi5cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5pbmZyYWhvdXNlLXJlbGVhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGFja2FnZS1wdWJsaXNoZXI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIxNzAxNzg0MTBdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDE3OGUxNzE4ZGViYTUxY2UxMDgwMjg5NDk0XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2N2MzMGU2NWRkNDEwOGU5MTA4MDI4OTQ5NF1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19idWNrZXRfcG9saWN5LnB1YmxpYy1hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZV1cbmF3c19pYW1fcG9saWN5LnBhY2thZ2UtcHVibGlzaGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9wYWNrYWdlLXB1Ymxpc2hlcl1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19idWNrZXRfYWNsLmluZnJhaG91c2UtcmVsZWFzZS1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtbG9ncyxwcml2YXRlXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5leHRyYVtcInBhY2thZ2UtcHVibGlzaGVyXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyLTIwMjMwNzIxMjExMDAxNzU1MzAwMDAwMDAxXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3MzX2J1Y2tldF9hY2wuaW5mcmFob3VzZS1yZWxlYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UscHVibGljLXJlYWRdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZS5zY2FsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2sudGVybWluYXRpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcm1pbmF0aW5nXVxubW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay5sYXVuY2hpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWxhdW5jaGluZ11cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLmluZnJhaG91c2UtcmVsZWFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9RTJWVkY2WVRHU0dSWjBdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGEtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1NjgwMjE0MDhdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kubGFtYmRhX3Blcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9sYW1iZGFfcGVybWlzc2lvbnMyMDIzMDcxMTE2MDUxMjcyNDIwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQubGFtYmRhX3Blcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxMzQxNjEwMDAwMDAwMl1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC5yZWxlYXNlX2luZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19yZWxlYXNlLmluZnJhaG91c2UuY29tX0FdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfbG9nX2dyb3VwLnVwZGF0ZV9kbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPS9hd3MvbGFtYmRhL3VwZGF0ZV9kbnNdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfdGFyZ2V0LnNjYWxlLW91dDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMS10ZXJyYWZvcm0tMjAyMzA3MTExNzI3NDc2MzA5MDAwMDAwMDJdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9wZXJtaXNzaW9uLmFsbG93X2Nsb3Vkd2F0Y2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFsbG93RXhlY3V0aW9uRnJvbUNsb3VkV2F0Y2gtb3V0XVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYV9sb2dnaW5nOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjY3MTQ1MzgyXVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9sb2dnaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9sYW1iZGFfbG9nZ2luZzIwMjMwNzExMTYwNTEzNzc4MzAwMDAwMDAzXVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5sYW1iZGFfbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTExNjA1MTQyNTExMDAwMDAwMDRdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgfiB1cGRhdGUgaW4tcGxhY2Vcbi0vKyBkZXN0cm95IGFuZCB0aGVuIGNyZWF0ZSByZXBsYWNlbWVudFxuIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJhZG1pblwiIHtcbiAgICAgIH4gYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICB+IHtcbiAgICAgICAgICAgICAgfiBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKVxuICAgICAgICAgICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgICAgICAgICBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCJcbiAgICAgICAgICAgICAgICAgICAgICAgIENvbmRpdGlvbiA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBTdHJpbmdFcXVhbHMgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgU3RyaW5nTGlrZSAgID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0OipcIlxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIEVmZmVjdCAgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICAgUHJpbmNpcGFsID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIEZlZGVyYXRlZCA9IFwiYXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIFNpZCAgICAgICA9IFwiMDEwXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICAgIC0ge1xuICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiXG4gICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFByaW5jaXBhbCA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBBV1MgPSBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cm9sZS9qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyXCJcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgICA9IFwiU3RhdGVtZW50MVwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGF0dHJpYnV0ZSBoaWRkZW4pXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW5cIlxuICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pblwiXG4gICAgICAgIHRhZ3MgICAgICAgICAgICAgICAgICA9IHt9XG4gICAgICAgICMgKDEwIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuZGF0YS5hcmNoaXZlX2ZpbGUubGFtYmRhIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93bilcbiA8PSBkYXRhIFwiYXJjaGl2ZV9maWxlXCIgXCJsYW1iZGFcIiB7XG4gICAgICArIGV4Y2x1ZGVzICAgICAgICAgICAgPSBbXG4gICAgICAgICAgKyBcIl9fcHljYWNoZV9fXCIsXG4gICAgICAgIF1cbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTI1NiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTUxMiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X21kNSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3BhdGggICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYTI1NiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYTUxMiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NpemUgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc291cmNlX2RpciAgICAgICAgICA9IFwibW9kdWxlcy9qdW1waG9zdC91cGRhdGVfZG5zXCJcbiAgICAgICsgdHlwZSAgICAgICAgICAgICAgICA9IFwiemlwXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2xhbWJkYV9mdW5jdGlvblwiIFwidXBkYXRlX2Ruc1wiIHtcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ1cGRhdGVfZG5zXCJcbiAgICAgIH4gbGFzdF9tb2RpZmllZCAgICAgICAgICAgICAgICAgID0gXCIyMDIzLTA3LTE2VDE1OjAzOjI1LjAwMCswMDAwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBzM19rZXkgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjM4YmZlMTU4LTIzOTktYTY0My1kN2FmLWJjNzhlNWMxZDgyYi56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHt9XG4gICAgICAgICMgKDIxIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfczNfb2JqZWN0LmxhbWJkYV9wYWNrYWdlIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcImF3c19zM19vYmplY3RcIiBcImxhbWJkYV9wYWNrYWdlXCIge1xuICAgICAgfiBidWNrZXRfa2V5X2VuYWJsZWQgICAgID0gZmFsc2UgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBjb250ZW50X3R5cGUgICAgICAgICAgID0gXCJiaW5hcnkvb2N0ZXQtc3RyZWFtXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBldGFnICAgICAgICAgICAgICAgICAgID0gXCJmMjdiMjRlNGUzOGVhMGE0NWE4OWEyM2ZmZjhlZWRhNS0zXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBpZCAgICAgICAgICAgICAgICAgICAgID0gXCIzOGJmZTE1OC0yMzk5LWE2NDMtZDdhZi1iYzc4ZTVjMWQ4MmIuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBrZXkgICAgICAgICAgICAgICAgICAgID0gXCIzOGJmZTE1OC0yMzk5LWE2NDMtZDdhZi1iYzc4ZTVjMWQ4MmIuemlwXCIgIyBmb3JjZXMgcmVwbGFjZW1lbnQgLT4gKGtub3duIGFmdGVyIGFwcGx5KSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgKyBrbXNfa2V5X2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgLSBtZXRhZGF0YSAgICAgICAgICAgICAgID0ge30gLT4gbnVsbFxuICAgICAgfiBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uID0gXCJBRVMyNTZcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHNvdXJjZSAgICAgICAgICAgICAgICAgPSBcIm1vZHVsZXMvanVtcGhvc3QvMzhiZmUxNTgtMjM5OS1hNjQzLWQ3YWYtYmM3OGU1YzFkODJiLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gc3RvcmFnZV9jbGFzcyAgICAgICAgICA9IFwiU1RBTkRBUkRcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7fSAtPiBudWxsXG4gICAgICArIHZlcnNpb25faWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDQgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5udWxsX3Jlc291cmNlLmluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llcyBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJudWxsX3Jlc291cmNlXCIgXCJpbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXNcIiB7XG4gICAgICB+IGlkICAgICAgID0gXCI5MDE0NzA5OTk2NzU0MjY0MDIxXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiB0cmlnZ2VycyA9IHsgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgICAgICB+IFwibWFpbl92ZXJzaW9uXCIgICAgICAgICA9IFwiZjAwZDAzOTU5ODQ0ZjkxN2NlYzA3ZmQ5OTBhMjI3YjBcIiAtPiBcImZmNDkyZmYwYmFiOWM4MDIxNmVhNDFhYTQ2YmYxZmQyXCJcbiAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LnJhbmRvbV91dWlkLmxhbWRhX3NyY19oYXNoIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcInJhbmRvbV91dWlkXCIgXCJsYW1kYV9zcmNfaGFzaFwiIHtcbiAgICAgIH4gaWQgICAgICA9IFwiMzhiZmUxNTgtMjM5OS1hNjQzLWQ3YWYtYmM3OGU1YzFkODJiXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBrZWVwZXJzID0geyAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgICAgIH4gXCJtYWluLnB5XCIgICAgICAgICAgPSBcImYwMGQwMzk1OTg0NGY5MTdjZWMwN2ZkOTkwYTIyN2IwXCIgLT4gXCJmZjQ5MmZmMGJhYjljODAyMTZlYTQxYWE0NmJmMWZkMlwiXG4gICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbilcbiAgICAgICAgfVxuICAgICAgfiByZXN1bHQgID0gXCIzOGJmZTE1OC0yMzk5LWE2NDMtZDdhZi1iYzc4ZTVjMWQ4MmJcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGUgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicHJvZmlsZVwiIHtcbiAgICAgICAgaWQgICAgICAgICAgPSBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2p1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjA0MDAwMDAwMDFcIlxuICAgICAgICBuYW1lICAgICAgICA9IFwianVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MDQwMDAwMDAwMVwiXG4gICAgICB+IHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICB+IHtcbiAgICAgICAgICAgICAgfiBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICB+IHtcbiAgICAgICAgICAgICAgICAgICAgICB+IEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwic3RzOkFzc3VtZVJvbGVcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImVjMjpEZXNjcmliZSpcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF0gLT4gXCJlYzI6RGVzY3JpYmUqXCJcbiAgICAgICAgICAgICAgICAgICAgICB+IFNpZCAgICAgID0gXCJWaXN1YWxFZGl0b3IwXCIgLT4gXCJcIlxuICAgICAgICAgICAgICAgICAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGF0dHJpYnV0ZSBoaWRkZW4pXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICAgdGFncyAgICAgICAgPSB7fVxuICAgICAgICAjICg1IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cblBsYW46IDMgdG8gYWRkLCAzIHRvIGNoYW5nZSwgMyB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG5SZWxlYXNpbmcgc3RhdGUgbG9jay4gVGhpcyBtYXkgdGFrZSBhIGZldyBtb21lbnRzLi4uXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBtb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTkwMTQ3MDk5OTY3NTQyNjQwMjFdJTBBbW9kdWxlLmp1bXBob3N0LnJhbmRvbV91dWlkLmxhbWRhX3NyY19oYXNoOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0zOGJmZTE1OC0yMzk5LWE2NDMtZDdhZi1iYzc4ZTVjMWQ4MmJdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20ucmFuZG9tX3Bhc3N3b3JkLnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5vbmVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX2FjbV9jZXJ0aWZpY2F0ZS5yZWxlYXNlX2luZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLWVhc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvNTE1NzY5N2QtYjE3OC00ODlkLWFiOTMtNzA3OTBiYzM5ODhmXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1rZXktNDNBUGFtXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNjkzNDQ1MDk3XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBYXdzX2tleV9wYWlyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrc10lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODk0MDY4ODI2XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTUyMjY1MTkyXSUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MDM4NDkzMzFdJTBBbW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfdnBjLnZwYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19idWNrZXQuaW5mcmFob3VzZS1yZWxlYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2VdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX2Nsb3VkZnJvbnRfY2FjaGVfcG9saWN5LmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVlMzFmNmVkLWM1MDMtNDA4Mi1hOWQ5LTg1MTdjOWU0Yzg3Ml0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3NfczNfYnVja2V0LmluZnJhaG91c2UtcmVsZWFzZS1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtbG9nc10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3MzX2J1Y2tldC5sYW1iZGFfdG1wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfem9uZS5pbmZyYWhvdXNlX2NvbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hbWktMDUwNzBjNzBkNGVjYzlmNzldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLXBhc3NwaHJhc2UtZVR5S3ZpXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hbWktMDUwNzBjNzBkNGVjYzlmNzldJTBBbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZS5pYW1fZm9yX2xhbWJkYTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGFdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEudGVtcGxhdGVfY2xvdWRpbml0X2NvbmZpZy5qdW1waG9zdDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLnRlbXBsYXRlX2Nsb3VkaW5pdF9jb25maWcuanVtcGhvc3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTUyMTY1NTc3M10lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjEwMDAwMDAwMDJdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2p1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjA0MDAwMDAwMDFdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cGFja2FnZXItcGFzc3BocmFzZS1lVHlLdml8MTUyRUUzMzEtQTMxRC00M0FCLUFFREYtNEM0RDY0RDI0QzQyXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3RdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnNwZjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX1NQRl0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9zcGY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9UWFRdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC5teDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX01YXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQudHh0X2RraW06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19nb29nbGUuX2RvbWFpbmtleS5pbmZyYWhvdXNlLmNvbV9UWFRdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3kuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9zZXJ2aWNlLXJvbGUvQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM5MTE4NDQ4NjhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTAxNjAzNTI0NmI0OTEwMmI1XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMmI0MmU3MGQ1MmE1ZGI3Zl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MTAwMDAwMDAwMi0yMDIzMDcxMDA0MzA0NTc4MTEwMDAwMDAwM10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTAxNzU0MzQ4NzgwMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtZ2l0aHViXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJyZWxlYXNlLmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfXzU1NTI1NmEzODZmZDRhZWM5YWFlZThhZmRmZTU4NWEyLnJlbGVhc2UuaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfbGF1bmNoX3RlbXBsYXRlLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wMWE4ZWY5NjgyMmI0YjAwYl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM4MjkzNzE2OV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4tMjAyMzA3MDkxNjQzMjEzMTk5MDAwMDAwMDFdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDRhMTZlNzRkNWIxMmEzMzhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDE3OGUxNzE4ZGViYTUxY2VdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGJjNmM0NGMxYjI2ZmVkMjJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2ludGVybmV0X2dhdGV3YXkuaWc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlndy0wNzkwOTBlMDllZDVkYjU4Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9zZWN1cml0eV9ncm91cC5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wOGI5NjBiODVmNTk5NjEwMF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGQ3MzM4M2FmZWI2YWQxNDJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDgzZTk2OWRjMzc3OWFmMjZdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBjZmZmYWNhMzI1ZDkzODI3XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19hY21fY2VydGlmaWNhdGVfdmFsaWRhdGlvbi5yZWxlYXNlX2luZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTAwMDEtMDEtMDEgMDA6MDA6MDAgKzAwMDAgVVRDXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA0YTE2ZTc0ZDViMTJhMzM4MTA4MDI4OTQ5NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMjEwODAyODk0OTRdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MzhiZmUxNTgtMjM5OS1hNjQzLWQ3YWYtYmM3OGU1YzFkODJiLnppcF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuZGVmYXVsdF9tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZDczMzgzYWZlYjZhZDE0MjEwODAyODk0OTRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMuaW5mcmFob3VzZS1yZWxlYXNlLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1sb2dzXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBlNzk1YmRhZWU2MjdhYTZjXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA4YTQxMDE2MGUyZGNjNTkyXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4YjFjZDA2YjA0MzA5OWVjXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBiZjI3OGI2YTM5NGFlZDQ0XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA5OWI5NThhZjE5NDg1ZjJiXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4ZmI5YjUyNjgzMjc3OTQ3XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfZ3JvdXAuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LTIwMjMwNzEwMDQ1NTEyMTY1NDAwMDAwMDAxXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLmluZnJhaG91c2UtcmVsZWFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19vYmplY3QuZGViLWdwZy1rZXktaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9REVCLUdQRy1LRVktaW5mcmFob3VzZV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1OTQzMjgxNTBdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3MzX2J1Y2tldF93ZWJzaXRlX2NvbmZpZ3VyYXRpb24uaW5mcmFob3VzZS1yZWxlYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2VdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3MzX29iamVjdC5pbmRleC1odG1sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmRleC5odG1sXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19vYmplY3QuZGlzdHJpYnV0aW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29uZi9kaXN0cmlidXRpb25zXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfbGFtYmRhX2Z1bmN0aW9uLnVwZGF0ZV9kbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVwZGF0ZV9kbnNdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wYWNrYWdlLXB1Ymxpc2hlcjogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5pbmZyYWhvdXNlLXJlbGVhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBhY2thZ2UtcHVibGlzaGVyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMTcwMTc4NDEwXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMTc4ZTE3MThkZWJhNTFjZTEwODAyODk0OTRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2N2MzMGU2NWRkNDEwOGU5MTA4MDI4OTQ5NF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3NfczNfYnVja2V0X3BvbGljeS5wdWJsaWMtYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2VdJTBBYXdzX2lhbV9wb2xpY3kucGFja2FnZS1wdWJsaXNoZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L3BhY2thZ2UtcHVibGlzaGVyXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19zM19idWNrZXRfYWNsLmluZnJhaG91c2UtcmVsZWFzZS1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtbG9ncyxwcml2YXRlXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZXh0cmFbXCJwYWNrYWdlLXB1Ymxpc2hlclwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MTAwMDAwMDAwMi0yMDIzMDcyMTIxMTAwMTc1NTMwMDAwMDAwMV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbS5hd3NfczNfYnVja2V0X2FjbC5pbmZyYWhvdXNlLXJlbGVhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZSxwdWJsaWMtcmVhZF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZS5zY2FsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2xpZmVjeWNsZV9ob29rLnRlcm1pbmF0aW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJtaW5hdGluZ10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2xpZmVjeWNsZV9ob29rLmxhdW5jaGluZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bGF1bmNoaW5nXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tLmF3c19jbG91ZGZyb250X2Rpc3RyaWJ1dGlvbi5pbmZyYWhvdXNlLXJlbGVhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUyVlZGNllUR1NHUlowXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzU2ODAyMTQwOF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kubGFtYmRhX3Blcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9sYW1iZGFfcGVybWlzc2lvbnMyMDIzMDcxMTE2MDUxMjcyNDIwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTExNjA1MTM0MTYxMDAwMDAwMDJdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnJlbGVhc2VfaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX3JlbGVhc2UuaW5mcmFob3VzZS5jb21fQV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfbG9nX2dyb3VwLnVwZGF0ZV9kbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPS9hd3MvbGFtYmRhL3VwZGF0ZV9kbnNdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2V2ZW50X3RhcmdldC5zY2FsZS1vdXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXNjYWxlMjAyMzA3MTExNzI3NDc1MDQ3MDAwMDAwMDEtdGVycmFmb3JtLTIwMjMwNzExMTcyNzQ3NjMwOTAwMDAwMDAyXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfbGFtYmRhX3Blcm1pc3Npb24uYWxsb3dfY2xvdWR3YXRjaDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QWxsb3dFeGVjdXRpb25Gcm9tQ2xvdWRXYXRjaC1vdXRdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGFfbG9nZ2luZzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjI2NzE0NTM4Ml0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kubGFtYmRhX2xvZ2dpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9sb2dnaW5nMjAyMzA3MTExNjA1MTM3NzgzMDAwMDAwMDNdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5sYW1iZGFfbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTExNjA1MTQyNTExMDAwMDAwMDRdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgIH4gdXBkYXRlIGluLXBsYWNlJTBBLS8rIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50JTBBIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbiB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcImFkbWluXCIgeyUwQSAgICAgIH4gYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgfiB7JTBBICAgICAgICAgICAgICB+IFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKSUwQSAgICAgICAgICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgICAgICAgICAgIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVXaXRoV2ViSWRlbnRpdHlcIiUwQSAgICAgICAgICAgICAgICAgICAgICAgIENvbmRpdGlvbiA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgU3RyaW5nRXF1YWxzID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgXCJ0b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbTphdWRcIiA9IFwic3RzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgIFN0cmluZ0xpa2UgICA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206c3ViXCIgPSBcInJlcG86aW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6KlwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgRWZmZWN0ICAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICAgUHJpbmNpcGFsID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICBGZWRlcmF0ZWQgPSBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbVwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAgIFNpZCAgICAgICA9IFwiMDEwXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gUHJpbmNpcGFsID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBBV1MgPSBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cm9sZS9qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgID0gXCJTdGF0ZW1lbnQxXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgIyAoMSB1bmNoYW5nZWQgYXR0cmlidXRlIGhpZGRlbiklMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pblwiJTBBICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pblwiJTBBICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgPSB7fSUwQSAgICAgICAgIyAoMTAgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5kYXRhLmFyY2hpdmVfZmlsZS5sYW1iZGEgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseSUwQSAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93biklMEEgPD0gZGF0YSBcImFyY2hpdmVfZmlsZVwiIFwibGFtYmRhXCIgeyUwQSAgICAgICsgZXhjbHVkZXMgICAgICAgICAgICA9IFslMEEgICAgICAgICAgKyBcIl9fcHljYWNoZV9fXCIsJTBBICAgICAgICBdJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTI1NiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9iYXNlNjRzaGE1MTIgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfbWQ1ICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3BhdGggICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9zaGEgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2hhMjU2ICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3NoYTUxMiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9zaXplICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzb3VyY2VfZGlyICAgICAgICAgID0gXCJtb2R1bGVzL2p1bXBob3N0L3VwZGF0ZV9kbnNcIiUwQSAgICAgICsgdHlwZSAgICAgICAgICAgICAgICA9IFwiemlwXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19sYW1iZGFfZnVuY3Rpb25cIiBcInVwZGF0ZV9kbnNcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVwZGF0ZV9kbnNcIiUwQSAgICAgIH4gbGFzdF9tb2RpZmllZCAgICAgICAgICAgICAgICAgID0gXCIyMDIzLTA3LTE2VDE1OjAzOjI1LjAwMCswMDAwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gczNfa2V5ICAgICAgICAgICAgICAgICAgICAgICAgID0gXCIzOGJmZTE1OC0yMzk5LWE2NDMtZDdhZi1iYzc4ZTVjMWQ4MmIuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge30lMEEgICAgICAgICMgKDIxIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LmF3c19zM19vYmplY3QubGFtYmRhX3BhY2thZ2UgbXVzdCBiZSByZXBsYWNlZCUwQS0vKyByZXNvdXJjZSBcImF3c19zM19vYmplY3RcIiBcImxhbWJkYV9wYWNrYWdlXCIgeyUwQSAgICAgIH4gYnVja2V0X2tleV9lbmFibGVkICAgICA9IGZhbHNlIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGNvbnRlbnRfdHlwZSAgICAgICAgICAgPSBcImJpbmFyeS9vY3RldC1zdHJlYW1cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBldGFnICAgICAgICAgICAgICAgICAgID0gXCJmMjdiMjRlNGUzOGVhMGE0NWE4OWEyM2ZmZjhlZWRhNS0zXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICA9IFwiMzhiZmUxNTgtMjM5OS1hNjQzLWQ3YWYtYmM3OGU1YzFkODJiLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGtleSAgICAgICAgICAgICAgICAgICAgPSBcIjM4YmZlMTU4LTIzOTktYTY0My1kN2FmLWJjNzhlNWMxZDgyYi56aXBcIiAjIGZvcmNlcyByZXBsYWNlbWVudCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpICMgZm9yY2VzIHJlcGxhY2VtZW50JTBBICAgICAgKyBrbXNfa2V5X2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gbWV0YWRhdGEgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICB+IHNlcnZlcl9zaWRlX2VuY3J5cHRpb24gPSBcIkFFUzI1NlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHNvdXJjZSAgICAgICAgICAgICAgICAgPSBcIm1vZHVsZXMvanVtcGhvc3QvMzhiZmUxNTgtMjM5OS1hNjQzLWQ3YWYtYmM3OGU1YzFkODJiLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHN0b3JhZ2VfY2xhc3MgICAgICAgICAgPSBcIlNUQU5EQVJEXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICArIHZlcnNpb25faWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAjICg0IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXMgbXVzdCBiZSByZXBsYWNlZCUwQS0vKyByZXNvdXJjZSBcIm51bGxfcmVzb3VyY2VcIiBcImluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llc1wiIHslMEEgICAgICB+IGlkICAgICAgID0gXCI5MDE0NzA5OTk2NzU0MjY0MDIxXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gdHJpZ2dlcnMgPSB7ICMgZm9yY2VzIHJlcGxhY2VtZW50JTBBICAgICAgICAgIH4gXCJtYWluX3ZlcnNpb25cIiAgICAgICAgID0gXCJmMDBkMDM5NTk4NDRmOTE3Y2VjMDdmZDk5MGEyMjdiMFwiIC0+IFwiZmY0OTJmZjBiYWI5YzgwMjE2ZWE0MWFhNDZiZjFmZDJcIiUwQSAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5yYW5kb21fdXVpZC5sYW1kYV9zcmNfaGFzaCBtdXN0IGJlIHJlcGxhY2VkJTBBLS8rIHJlc291cmNlIFwicmFuZG9tX3V1aWRcIiBcImxhbWRhX3NyY19oYXNoXCIgeyUwQSAgICAgIH4gaWQgICAgICA9IFwiMzhiZmUxNTgtMjM5OS1hNjQzLWQ3YWYtYmM3OGU1YzFkODJiXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4ga2VlcGVycyA9IHsgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgICAgICAgfiBcIm1haW4ucHlcIiAgICAgICAgICA9IFwiZjAwZDAzOTU5ODQ0ZjkxN2NlYzA3ZmQ5OTBhMjI3YjBcIiAtPiBcImZmNDkyZmYwYmFiOWM4MDIxNmVhNDFhYTQ2YmYxZmQyXCIlMEEgICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbiklMEEgICAgICAgIH0lMEEgICAgICB+IHJlc3VsdCAgPSBcIjM4YmZlMTU4LTIzOTktYTY0My1kN2FmLWJjNzhlNWMxZDgyYlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9wb2xpY3kucHJvZmlsZSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicHJvZmlsZVwiIHslMEEgICAgICAgIGlkICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYwNDAwMDAwMDAxXCIlMEEgICAgICAgIG5hbWUgICAgICAgID0gXCJqdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYwNDAwMDAwMDAxXCIlMEEgICAgICB+IHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgfiB7JTBBICAgICAgICAgICAgICB+IFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICB+IHslMEEgICAgICAgICAgICAgICAgICAgICAgfiBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzdHM6QXNzdW1lUm9sZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImVjMjpEZXNjcmliZSpcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdIC0+IFwiZWMyOkRlc2NyaWJlKlwiJTBBICAgICAgICAgICAgICAgICAgICAgIH4gU2lkICAgICAgPSBcIlZpc3VhbEVkaXRvcjBcIiAtPiBcIlwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGF0dHJpYnV0ZSBoaWRkZW4pJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICAgdGFncyAgICAgICAgPSB7fSUwQSAgICAgICAgIyAoNSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgIH0lMEElMEFQbGFuOiAzIHRvIGFkZCwgMyB0byBjaGFuZ2UsIDMgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFSZWxlYXNpbmcgc3RhdGUgbG9jay4gVGhpcyBtYXkgdGFrZSBhIGZldyBtb21lbnRzLi4uJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDMsICJjaGFuZ2UiOiAzLCAiZGVzdHJveSI6IDN9fQ==```
</p></details>